/*
 * Задачи на математические функции JavaScript
 */

/* 
? 2. Даны переменные a и b. Проверьте, что a делится без остатка на b. Если это так - выведите 'Делится' и результат деления, иначе выведите 'Делится с остатком' и остаток от деления. 
*/

// let a = prompt("Введите число a", 10);
// let b = prompt("Введите число b", 2);
// const rest = a % b;
// console.log(!rest ? "Делится" : `Делится с остатком ${rest}`);

/*
 * Работа со степенью и корнем
 */

const st = Math.pow(2, 10);
console.log(st);

const sqrt = Math.sqrt(245);
console.log(sqrt);

const arr = [4, 2, 5, 19, 13, 0, 10];
